#include <stdio.h>

int main(int argc, char *argv[]) { 
  
  // Первая матрица размером 2x3 
  int m1[2][3] = {
    {1, 1, 1},
    {1, 1, 1} 
  };
  
  // Вторая матрица размером 3x2 
  int m2[3][2] = {
    {1, 1},
    {1, 1},
    {1, 1}
  };

  // Третья матрица 
  int m3[2][2] = {0};
  
  // N0 - количество строк в первой матрице и столбцов во второй 
  // Произведение матриц будет иметь размер N0xN0
  int N0 = sizeof(m1) / sizeof(m1[0]);
  
  // N1 - количество столбцов в первой матрице и строк во второй 
  int N1 = sizeof(m1[0]) / sizeof(m1[0][0]);
  int i, j, c, r;
  
  // Умножение матриц: "строка на столбец" 
  for(r = 0; r < N0; r++){
    for(c = 0; c < N0; c++){ 
      for(i = 0; i < N1; i++){
        m3[r][c] = m3[r][c] + m1[r][i] * m2[i][c];
      } 
    }
  }

  // Выводим на экран элементы матрицы 
  for(r = 0; r < N0; r++){
    for(c = 0; c < N0; c++){
      printf("%d, ", m3[r][c]); 
    }
    printf("\n"); 
  }
  
  return 0; 
}